{
  "name": "Хоббит",
  "startNodeId": 1,
  "pages": [
    {
      "id": 1,
      "displayText": "Как-то тихим утром вы, плотно подзакусив и покуривая трубку, стояли у двери своего обиталища, добродушно наблюдая за странно одетым стариком в дорожном плаще и остроконечной шляпе, сжимавшем в руке посох.",
      "choices": [
        {
          "id": 101,
          "displayText": "Вы здороваетесь и предлагаете старику отдохнуть."
        }
      ]
    },
    {
      "id": 101,
      "displayText": "– Спасибо за приглашение, но мне некогда заниматься пустяками. Я должен найти того, кто согласится отправиться со мной навстречу приключениям, — отзывается странник.",
      "choices": [
        {
          "id": 102,
          "displayText": "Вы отвечаете, что в здешних краях никто не согласится на такое"
        }
      ]
    },
    {
      "id": 102,
      "displayText": "Не смотря на ваш ответ, упрямый старик не желает уходить.\n\nОн признается, что пришел в Шир исключительно за вами, чтобы приключение пошло вам на пользу, а также принесло некоторую выгоду.",
      "choices": [
        {
          "id": 2,
          "displayText": "— Извините! Мне что-то не хочется, спасибо, как-нибудь в другой раз. Всего хорошего! Пожалуйста, заходите ко мне на чашку чая в любой день! Скажем, завтра? Приходите завтра! До свиданья!"
        },
        {
          "id": 16,
          "displayText": "— Спасибо за предложение, но не думаю. Не знаю, почему вы так думаете, но я Бэггинс, поэтому предпочту остаться здесь. Прощайте! Надеюсь, в другом месте вы найдете более безрассудного тупицу!"
        }
      ]
    },
    {
      "id": 2,
      "displayText": "Когда на следующий день вы собираетесь выпить чай, дверной колокольчик оповещает о посетителе. Но это не Гэндальф, а гном, который сразу шмыгнул внутрь, как будто только его и ждали.",
      "choices": [
        {
          "id": 201,
          "displayText": "Вы решаете проявить радушие и приглашаете его к столу."
        }
      ]
    },
    {
      "id": 201,
      "displayText": "Таким же способом внутри вашей норы оказывается еще дюжина гномов с наконец-таки присоединившимся волшебником.\n\nГномы открывают вам историю о их потерянном доме, отобранном драконом наследии, богатстве и чести. Гэндальф предлагает ваши услуги в качетве взломщика, который мог бы сопровождать их в приключении, чей целью и будет исправление несправедливого захватничества. Вы нужны им, чтобы проникнуть в спрятанный в горе потайной ход.\n\nВозглавляющий отряд гномов нелестно отзывается о вашем характере, что вас задевает. Однако с подачи и рекомендации мага он оставляет вам договор, обещая четырнадцатую часть добычи и покрытие похоронных и путевых издержек.\n\nВы задумываетесь о выборе.",
      "choices": [
        {
          "id": 3,
          "displayText": "Вы понимаете, что гномы считают вас никуда не годным. Но вы намерены доказать, на что способны."
        },
        {
          "id": 16,
          "displayText": "При словах о том, что вы или гномы \"могут не вернуться назад\",  вы почувствовали, что к горлу подкатывается крик. Тут уж никакими компенсациями и деньгами не изменить перспективу."
        }
      ]
    },
    {
      "id": 3,
      "displayText": "Вы выдвигаетесь в путь, держа его несколько дней. В один из привалов обнаруживается, что пропали ваши пони, поэтому вас, как взломщика, отправляют на разведку. \n\nПони оказываются вероятным ужином озлобленных скудностью рациона троллей.",
      "choices": [
        {
          "id": 301,
          "displayText": "В попытке не спасти транспорт, так обчистить троллей, — как истинный взломщик, вы пытаетесь украсть их кошельки"
        }
      ]
    },
    {
      "id": 301,
      "displayText": "Ваша попытка оканчивается неудачей, а появившихся на выручку товарищей поджидает та же участь, что и вас временем ранее — теперь весь отряд оказываается схвачен, связан и обездвижен огромными великанами, жаждущими приготовить из вас замечательный ужин.\n\nУ вас не так много вариантов для дальнейших действий.",
      "choices": [
        {
          "id": 4,
          "displayText": "Вы начинаете утверждаете, что без должной обработки гномы окажутся невкусными и грозят несварением."
        },
        {
          "id": 15,
          "displayText": "Вы решаете воспользоваться своими навыки и попытаться выскользнуть из мешка, чтобы незаметно помочь остальным."
        }
      ]
    },
    {
      "id": 4,
      "displayText": "Гэндальф, искусно подделывая голоса троллей, вступает в их разговор и тянет время до рассвета. С первыми лучами солнца тролли превращаются в камень, и отряд получает возможность продолжить путешествие.",
      "choices": [
        {
          "id": 401,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 401,
      "displayText": "При переходе через Туманные горы на пути к цели отряд по неосторожности попадает в плен к гоблинам, которые отводят вас в подземелья, но Гэндальф и здесь вновь помогает спастить, вступая в сражение. Однако в хитросплетении пещер и гуще сражений, вы отбиваетесь от группы и теряетесь в пещерах, где находите золотое кольцо.",
      "choices": [
        {
          "id": 402,
          "displayText": "Как вор и взломщик, вы не можете отказать себе в желании его забрать"
        }
      ]
    },
    {
      "id": 402,
      "displayText": "Там же вы встречаете и Голлума — скользкое существо, живущее у подземного озера.\n\nОн предлагает сыграть с ним в загадки, чтобы выбраться из пещер, в случае проигрыша угрожая расправиться с вами. У вас нет выбора — и...",
      "choices": [
        {
          "id": 5,
          "displayText": "вы внимаете Голлуму"
        }
      ]
    },
    {
      "id": 5,
      "displayText": "Первая загадка такова:\n\nНе увидать ее корней,\nВершина выше тополей,\nВсе вверх и вверх она идет,\nНо не растет.",
      "choices": [
        {
          "id": 6,
          "displayText": "гора"
        },
        {
          "id": 15,
          "displayText": "многоэтажка"
        },
        {
          "id": 15,
          "displayText": "секвойя"
        }
      ]
    },
    {
      "id": 6,
      "displayText": "Затем он задал вторую загадку:\n\nВез голоса кричит,\nБез зубов кусает,\nБез крыльев летит,\nБез горла завывает.",
      "choices": [
        {
          "id": 7,
          "displayText": "ветер"
        },
        {
          "id": 15,
          "displayText": "холод"
        },
        {
          "id": 15,
          "displayText": "левиафан"
        }
      ]
    },
    {
      "id": 7,
      "displayText": "На сей раз он загадал загадку покаверзнее:\n\nЕе не видать\nИ в руки не взять,\nЦарит над всем,\nНе пахнем ничем.\nВстает во весь рост\nНа небе меж звезд.\nВсе начинает\nИ все кончает.",
      "choices": [
        {
          "id": 8,
          "displayText": "темнота"
        },
        {
          "id": 15,
          "displayText": "расстояние"
        },
        {
          "id": 15,
          "displayText": "размерность"
        }
      ]
    },
    {
      "id": 8,
      "displayText": "— Ты справился с тремя загадками. Что ты ответишь на эту?\n\nУничтожает все кругом:\nЦветы, зверей, высокий дом,\nСжует железо, сталь сожрет\nИ скалы в порошок сотрет,\nМощь городов, власть королей\nЕго могущества слабей.",
      "choices": [
        {
          "id": 9,
          "displayText": "время"
        },
        {
          "id": 15,
          "displayText": "упокоение"
        },
        {
          "id": 15,
          "displayText": "эррозия"
        }
      ]
    },
    {
      "id": 9,
      "displayText": "Вам кажется, что все идет хорошо, но Голлум подозревает вас в краже своего волшебного кольца, способного делать владельца невидимым, и поэтому нападает на вас.\n\nСлучайно, надев кольцо на палец, вы понимаете, что за способность оно в силах даровать.",
      "choices": [
        {
          "id": 901,
          "displayText": "Так, следуя за Голлумом, вы и находите выход из пещер."
        }
      ]
    },
    {
      "id": 901,
      "displayText": "А вскоре и своих спутников. Но вскоре вас снова настигают враги — на этот раз к отряду настигают гоблинов присоединяются варги, и только вмешательство орлов, которых успевает призвать ваш крайне полезный и результативный волшебник, спасает вам жизни.\n\nВ дальнейшем вашем маршруте, который оказывается Лихолесьем, Гэндальф снова покидает вас, отправившись по неотложным делам. Лес кажется бесконечным, ему нет конца. Он темен и болен.",
      "choices": [
        {
          "id": 902,
          "displayText": "вас и ваших спутников охватывает уныние"
        }
      ]
    },
    {
      "id": 902,
      "displayText": "Именно оно заставляет их покинуть тропу, с которой запретил сходить маг, и оказаться посему в лапах гигантских пауков. Вы знаете, что можете помочь остальным, но для этого нужно воспользоваться кольцом, о котором вы мало что знаете, но которое уже вызывает в вас паническую тревогу. И вас все еще могут учуять, раз не могут увидеть!\n\nОднако время не терпит, и выбор должен быть сделан.",
      "choices": [
        {
          "id": 10,
          "displayText": "Вы решаете, что воспользоваться артефактом — единственный возможный вариант"
        },
        {
          "id": 15,
          "displayText": "Кольцо принадлежало ранее существу, которое сошло с ума — вы предпочли бы избежать такого исхода для себя"
        }
      ]
    },
    {
      "id": 10,
      "displayText": "Однако не все гномы оказались в пучьей ловушке. В это время их предводитель, Торин, оказался схвачен и заточен эльфами. Отправившись его вызвалять, они, обессиленные долгими скитаниями по гиблому лесу и схваткой, так же оказываются схваченными. Время тянется невыносимо уныло, пока гномов добрашивают и разводят по тюремным камерам.",
      "choices": [
        {
          "id": 1001,
          "displayText": "Вы прячетесь, не смея ни на минуту снять кольцо, почти не смыкая глаз, даже когда удается забиться в самый дальний, темный уголок."
        }
      ]
    },
    {
      "id": 1001,
      "displayText": "Дни в крепости эльфов, кажется, просто тянут время перед неминуемым крахом их предприятия. На этот раз Гэндальф не успеет прийти к ним на помощь.\n\nА тем временем вы — единственный из отряда, кто еще способен изменить ситуацию — для себя или для отряда.",
      "choices": [
        {
          "id": 11,
          "displayText": "И снова вы думаете воспользоваться кольцом"
        },
        {
          "id": 18,
          "displayText": "Вы не успеваете ничего сделать, попавшись страже эльфийского замка."
        },
        {
          "id": 16,
          "displayText": "Возможно, самое время отступить и вернуться домой. Хотя бы живым."
        }
      ]
    },
    {
      "id": 11,
      "displayText": "После успешного побега из эльфийского заключения, выш отряд наконец почти у цели — вы прибываете в Озёрный город, минуете его и достигаете Одинокой Горы.\n\nТеперь вы готовы справиться ос своей первоначальной задачей, предписанной контрактом, — по потайному пути вы двигаетесь в зал, где ныне дремлет дракон. Вы двигаетесь неслышно, невидимы его глазу благодаря кольцу.",
      "choices": [
        {
          "id": 1101,
          "displayText": "Но вы забыли, что у драконов поразительный нюх."
        }
      ]
    },
    {
      "id": 1101,
      "displayText": "— Ага, пожаловал, вор! Я тебя чую, я слышу твое дыхание. \n\nНа этот раз вы хотите...",
      "choices": [
        {
          "id": 12,
          "displayText": "попытаться выиграть время, льстя дракону в надежде, что найдете выход"
        },
        {
          "id": 16,
          "displayText": "попытаться бежать"
        },
        {
          "id": 17,
          "displayText": "поговорить о произошедшем"
        }
      ]
    },
    {
      "id": 12,
      "displayText": "— Я убиваю, когда захочу, никто не дерзает сопротивляться. Всех воинов прошлого я уничтожил, а нынче такие не рождаются, — злорадно торжествовал дракон. — Моя броня вдесятеро крепче щитов, мои зубы — мечи, когти — копья, удар хвоста подобен удару молнии, крылья несут с быстротой урагана, мое дыхание — смерть!",
      "choices": [
        {
          "id": 1201,
          "displayText": "Вы продолжаете наблюдать за драконом"
        }
      ]
    },
    {
      "id": 1201,
      "displayText": "Вы узнаёте о слабом месте дракона — ведь слушая ваши льстивые речи и отвечая им, он случайно продемонстрировал отсутствующую чешую на его туловище. Однако, сумевшись скрыться, вы разозлили дракона, поэтому он решает отомстить жителям Озёрного города за помощь гномам в походе на гору, нападает на поселение и сжигает его.\n\nДрозд, который услышал ваш рассказ об уязвимом месте дракона, сообщает об этом лучнику Барду, и тот убивает дракона.",
      "choices": [
        {
          "id": 13,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 13,
      "displayText": "Теперь радость победы омрачнена уже армиями лесных эльфов и жителей Озёрного города. Бард, возглавляющий людей, требует от Торина поделиться с ним частью сокровищ, как и король лесных эльфов. Торин отказывается выполнять претезания на вновь обретенные богатства — он опьянен ими, перебирает их часами напролет, теряя рассудок, подчиненный блеском зачарованного драконом золота.",
      "choices": [
        {
          "id": 1301,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 1301,
      "displayText": "Он в поисках среди драгоценностей. Аркенстон — драгоценный камень королевской династии гномов, представляющий для Торина наибольшую ценность среди всех сокровищ. Вы до сих пор не в силах признаться, что нашли его, потому что опасаетесь за рассудок гнома, уже продемонстрировавшего ожесточенность в переговорах с осаждающими. \nДело приобретает новый виток трудностей.\n\nВы решаете...",
      "choices": [
        {
          "id": 14,
          "displayText": "вынудить гномов вести переговоры и решить конфликт мирным путём"
        },
        {
          "id": 19,
          "displayText": "отдать камень Торину — потому что вы честный хоббит, а он его законный владелец"
        },
        {
          "id": 19,
          "displayText": "оставить это все — ваша роль здесь окончена, вы выполнили контракт, поэтому хотели бы взять причитающуюся долю и вернуться домой"
        }
      ]
    },
    {
      "id": 14,
      "displayText": "Вы передаёте предводителям армий людей и эльфов в качестве залога найденный Аркенстон, поэтому Торин обвиняет вас в предательстве и прогоняет. В это же время к Одинокой Горе подходит войско гномов из Железных Холмов под руководством родственника Торина. Враждующие стороны едва не начинают битву, однако у Одинокой Горы неожиданно появляются армии гоблинов и варгов. В этих обстоятельствах гномы, эльфы и люди объединяются против общих врагов.",
      "choices": [
        {
          "id": 1401,
          "displayText": "Начинается сражение"
        }
      ]
    },
    {
      "id": 1401,
      "displayText": "Победа достигнута, но дорогой ценой — погибают многие воины, в том числе Торин, перед самой смертью успевший понять и простить ваш поступок. Вы наконец можете отправиться домой, чтобы вернуться к спокойной жизни и вести захватывающие мемуары.",
      "choices": []
    },
    {
      "id": 15,
      "displayText": "Не все приключения заканчиваются счастливым концом. Вам тоже не повезло. Возможно, стоило быть менее любезным с незнакомцем в солнечный летний денек, может быть, вы совсем забыли об осторожности в ходе этого увлекательного похода и поступили недостаточно осмотрительно. Однако сейчас для вас и ваших компаньонов все кончено.",
      "choices": [
        {
          "id": 1501,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 16,
      "displayText": "Не все приключения заканчиваются счастливым концом. Но многие из них даже не начинаются. Сейчас вы спокойно можете жить в своей норе, пить чай в полуденной время, потягивать табак на крыльце, скрытые лиственной тенью. Однако, возможно, именно ваше присутствие могло бы что-то изменить в грядущих событиях. Возможно, стоило быть менее любезным с незнакомцем в солнечный летний денек.",
      "choices": [
        {
          "id": 1501,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 1501,
      "displayText": "Одинокая гора все так же останется в лапах дракона, спящего на кучах золота, добытого трудом предков Торина в шахтах и рудниках. Самый большой дракон из ныне живущих вскоре окажется побеспокоен Некромантом, и кто знает, смогут ли они договориться...",
      "choices": [
        {
          "id": 1502,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 1502,
      "displayText": "Кольцо, ранее принадлежащее величайшему врагу Свободных народов Средиземья, вскоре должно будет вернуться своему хозяину. И вот тогда спокойной ленности забывшех о войне земель придет конец.",
      "choices": []
    },
    {
      "id": 17,
      "displayText": "Пребывая в ярости и намереваясь отомстить, дракон отправился в Озерный город. Его лучники могли сколько угодно стрелять в дракона, но не могли причинить ему вреда — его чешуя, соедивнившаяся за годы с золотом и драгоценными камнями из груд сокровищ, на которых он возлежал, была неуязвима. Смауг поджёг и разрушил большую часть домов в Эсгароте.",
      "choices": [
        {
          "id": 1701,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 1701,
      "displayText": "Чёрная стрела, выкованная в кузнице короля Под Горой, не может поразить Смауга в единственное слабое место на груди, туда, где прореха в драгоценной броне, потому как об уязвимости никто так и не узнает.",
      "choices": [
        {
          "id": 15,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 18,
      "displayText": "Теперь, к сожалению, путь гномов так и останется незаконченным.",
      "choices": [
        {
          "id": 15,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 19,
      "displayText": "Бард, возглавляющий людей, требует от Торина поделиться с ним частью сокровищ, обосновывая это следующим образом:\n1) он убил дракона, поэтому заслуживает награды;\n2) он является наследником Гириона, властителя Дейла, а часть своих сокровищ дракон похитил из этого города;\n3) по вине гномов Смауг уничтожил Озёрный город, жители которого оказали помощь Торину и его спутникам во время похода.",
      "choices": [
        {
          "id": 1901,
          "displayText": "Вперед"
        }
      ]
    },
    {
      "id": 1901,
      "displayText": "У могущественного короля лесных эльфов и в самом деле была слабость — он был скуповат. Сокровищница его ломилась от золота, серебра и алмазов, но он хотел еще и еще, чтобы сравняться в богатстве с прежними властелинами эльфов. Теперь же он хотел от эльфов возвращения части сокровищ, принадлежавших ему.\n\nИменно поэтому им предстояла долгая осада, потому как уже очарованный драконим золотом Торин не собирался делиться и долей полученного богатства.",
      "choices": [
        {
          "id": 15,
          "displayText": "Вперед"
        }
      ]
    }
  ]
}